Бух_тест/src/InformationRegisters/НастройкаНумерацииНалоговыхДокументов/НастройкаНумерацииНалоговыхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаНумерацииНалоговыхДокументов</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ВестиДневнуюНумерациюНалоговыхДокументов</name>
    <comment>Возможность вести нумерацию Налоговых накладных и Приложений 2 с № 1 каждый день</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиМесячнуюНумерациюНалоговыхДокументов</name>
    <comment>Возможность вести нумерацию Налоговых накладных и Приложений 2 с № 1 каждый месяц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиНумерациюНалоговыхДокументовБезУчетаОбособленныхПодразделений</name>
    <comment>Возможность вести нумерацию налоговых документов без учета обособленных подразделений, в случае, когда обособленные подразделения указаны в документах</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиРаздельнуюНумерациюНалоговыхДокументов</name>
    <comment>Разные нумераторы для Налоговой накладной и Приложения 2 к налоговой накладной</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиРаздельнуюНумерациюНалоговыхДокументовПоНеНДСОперациям</name>
    <comment>Технологические налоговые документы &quot;Не НДС&quot; не будут занимать номера обычных налоговых</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиРаздельнуюНумерациюНалоговыхДокументовПоСпецРежимам</name>
    <comment>Разные нумераторы для Налоговой накладной и Приложения 2 к налоговой накладной для разных спец. режимов</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиРаздельнуюНумерациюНалоговыхНакладныхПоОбычнымЦенам</name>
    <comment>Будут ли налоговые накладные по ОЦ занимать номер налогой накладной или будут иметь тот же номер, что и основаная налоговая (но тип причины невыдачи = 01)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Бух_тест/src/InformationRegisters/НастройкаНумерацииНалоговыхДокументов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, ИмяРеквизита, ЗначениеПоУмолчанию)

	Если НЕ ДанныеЗаполнения.Свойство(ИмяРеквизита, ЗаписьРегистра[ИмяРеквизита]) Тогда
		ЗаписьРегистра[ИмяРеквизита] = ЗначениеПоУмолчанию;
	КонецЕсли;

КонецПроцедуры

Процедура УстановкаНастройкиНумерацииНалоговыхНакладныхПоУмолчанию(ЗаписьРегистра, ДанныеЗаполнения) Экспорт

	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "Организация", БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация"));
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "Период", НачалоГода(ТекущаяДатаСеанса()));
	
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "ВестиМесячнуюНумерациюНалоговыхДокументов", 							Ложь);
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "ВестиНумерациюНалоговыхДокументовБезУчетаОбособленныхПодразделений", Истина);
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "ВестиРаздельнуюНумерациюНалоговыхДокументов", 						Ложь);
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "ВестиРаздельнуюНумерациюНалоговыхДокументовПоНеНДСОперациям", 		Ложь);
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "ВестиРаздельнуюНумерациюНалоговыхДокументовПоСпецРежимам", 			Истина);
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "ВестиРаздельнуюНумерациюНалоговыхНакладныхПоОбычнымЦенам", 			Ложь);
	
КонецПроцедуры

#КонецЕсли
